# Pandasql

Veamos como funciona pandasql...

In [18]:
%matplotlib inline
import numpy as np
import pandas as pd
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

df = pd.DataFrame({
    "id": [1001, 1002, 1003],
    "first_name": ["John", "Robert", "John"],
    "last_name": ["Foo", "Garcia", "Wayne"],
    "age" : [20, 39, 65]
   })

skills = pd.DataFrame({
    'id': [1001, 1002, 1003, 1002],
    'skill_name': ["hipstering", "kung fu", "shooting", "karate"]
})

In [14]:
pysqldf("SELECT * from df")

   age first_name    id last_name
0   20       John  1001       Foo
1   39     Robert  1002    Garcia
2   65       John  1003     Wayne

In [15]:
pysqldf("SELECT * from df where first_name='John'")

   age first_name    id last_name
0   20       John  1001       Foo
1   65       John  1003     Wayne

In [16]:
pysqldf("SELECT * from df where age < 40")

   age first_name    id last_name
0   20       John  1001       Foo
1   39     Robert  1002    Garcia

In [28]:
pysqldf("SELECT * FROM df as users INNER JOIN skills as s ON users.id=s.id")

   age first_name    id last_name    id  skill_name
0   20       John  1001       Foo  1001  hipstering
1   39     Robert  1002    Garcia  1002     kung fu
2   39     Robert  1002    Garcia  1002      karate
3   65       John  1003     Wayne  1003    shooting